C++的特性：

- 可以完全控制c++的每一条指令
- 更加底层，



函数的主要目的是防止代码重复，尽量少去粘粘代码



# 头文件

`#`后的内容会先处理，被称为与处理



`#pragma once`作用：可以阻止单个头文件被多次包含，并转换为单个翻译单元

​	头文件可能被被包含在另一个头文件中，无意间可能会在同一个cpp文件中写了两次

也可以使用另一种方式

```c++
#ifndef  ABC
#define  ABC

要定义的内容
  
#endif
```

当被定义第二次时，第二次就会失效，这样可以成功防止被头文件被多次的使用造成的错误



为什么头文件中有的使用 尖括号，有的使用“ ”

`#include “ ”`通查使用在这个头文件就在当前目录中，也可以在“ ”中直接指定这个的地址

尖括号`#include < >`是有固定的安装目录路径的，尖括号只用于编译器包含路径，引号可以做一切



为什么有的头文件后面跟 .h 而有的没有？

`.h`是用来区分c库还是c++库的，C++库没有`.h`

 




# 注释的使用

在C++中更加推荐使用

```
#if 0
  需要注释的内容和代码
#endif
```

来注释

- 作用是可以省去 `/*  注释内容  */`这种方式会容易发生嵌套注释，导致注释无法成功实现
- ==只需要讲`#if 0`改为`#if 1`就可以将注释的代码成功启动（起到快速开关的作用）==



函数的主要目的是防止代码重复，尽量少去粘粘代码